In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
np.random.seed(101)
myData = np.random.randint(0,101,(4,3))

In [4]:
myData

array([[95, 11, 81],
       [70, 63, 87],
       [75,  9, 77],
       [40,  4, 63]])

In [5]:
myIndex = ['Kol','Hwh','Bdn','Hbr']

In [6]:
myColumns = ['Jan', 'Feb', 'Mar']

In [7]:
df = pd.DataFrame(myData,myIndex,myColumns)

In [8]:
df

     Jan  Feb  Mar
Kol   95   11   81
Hwh   70   63   87
Bdn   75    9   77
Hbr   40    4   63

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Kol to Hbr
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Jan     4 non-null      int32
 1   Feb     4 non-null      int32
 2   Mar     4 non-null      int32
dtypes: int32(3)
memory usage: 80.0+ bytes

In [10]:
pwd

'c:\\Users\\user\\OneDrive\\Documents\\GitHub\\c---programs\\ML-DS\\practices\\pandas'

In [11]:
ls

 Volume in drive C is OS
 Volume Serial Number is 8A59-8836

 Directory of c:\Users\user\OneDrive\Documents\GitHub\c---programs\ML-DS\practices\pandas

22-07-2023  07:57    <DIR>          .
22-07-2023  06:59    <DIR>          ..
22-07-2023  21:32             4,882 Dataframes.ipynb
22-07-2023  07:40            13,484 Series.ipynb
               2 File(s)         18,366 bytes
               2 Dir(s)  117,151,436,800 bytes free

In [14]:
df = pd.read_csv('tips.csv')

In [15]:
df

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672